hpmicro/hpm_sdk/soc/HPM5301/hpm_sysctl_regs.h
/*
 * RESET_FLAG (RW)
 *
 * CPU0 reset flag, indicate a reset event got active, write 1 to clear this bit
 * 0: CPU0 reset not happened
 * 1: CPU0 reset happened
 */
#define SYSCTL_CPU_LP_RESET_FLAG_MASK (0x100U)
#define SYSCTL_CPU_LP_RESET_FLAG_SHIFT (8U)
#define SYSCTL_CPU_LP_RESET_FLAG_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_RESET_FLAG_SHIFT) & SYSCTL_CPU_LP_RESET_FLAG_MASK)
#define SYSCTL_CPU_LP_RESET_FLAG_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_RESET_FLAG_MASK) >> SYSCTL_CPU_LP_RESET_FLAG_SHIFT)

/*
 * MODE (RW)
 *
 * Low power mode, system behavior after WFI
 * 00: CPU clock stop after WFI
 * 01: System enter low power mode after WFI
 * 10: Keep running after WFI
 * 11: reserved
 */
#define SYSCTL_CPU_LP_MODE_MASK (0x3U)
#define SYSCTL_CPU_LP_MODE_SHIFT (0U)
#define SYSCTL_CPU_LP_MODE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LP_MODE_SHIFT) & SYSCTL_CPU_LP_MODE_MASK)
#define SYSCTL_CPU_LP_MODE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LP_MODE_MASK) >> SYSCTL_CPU_LP_MODE_SHIFT)

/* Bitfield definition for register of struct array CPU: LOCK */
/*
 * GPR (RW)
 *
 * Lock bit for CPU_DATA0 to CPU_DATA13, once set, this bit will not clear untile next reset
 */
#define SYSCTL_CPU_LOCK_GPR_MASK (0xFFFCU)
#define SYSCTL_CPU_LOCK_GPR_SHIFT (2U)
#define SYSCTL_CPU_LOCK_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_GPR_SHIFT) & SYSCTL_CPU_LOCK_GPR_MASK)
#define SYSCTL_CPU_LOCK_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_GPR_MASK) >> SYSCTL_CPU_LOCK_GPR_SHIFT)

/*
 * LOCK (RW)
 *
 * Lock bit for CPU_LOCK
 */
#define SYSCTL_CPU_LOCK_LOCK_MASK (0x2U)
#define SYSCTL_CPU_LOCK_LOCK_SHIFT (1U)
#define SYSCTL_CPU_LOCK_LOCK_SET(x) (((uint32_t)(x) << SYSCTL_CPU_LOCK_LOCK_SHIFT) & SYSCTL_CPU_LOCK_LOCK_MASK)
#define SYSCTL_CPU_LOCK_LOCK_GET(x) (((uint32_t)(x) & SYSCTL_CPU_LOCK_LOCK_MASK) >> SYSCTL_CPU_LOCK_LOCK_SHIFT)

/* Bitfield definition for register of struct array CPU: GPR0 */
/*
 * GPR (RW)
 *
 * register for software to handle resume, can save resume address or status
 */
#define SYSCTL_CPU_GPR_GPR_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_GPR_GPR_SHIFT (0U)
#define SYSCTL_CPU_GPR_GPR_SET(x) (((uint32_t)(x) << SYSCTL_CPU_GPR_GPR_SHIFT) & SYSCTL_CPU_GPR_GPR_MASK)
#define SYSCTL_CPU_GPR_GPR_GET(x) (((uint32_t)(x) & SYSCTL_CPU_GPR_GPR_MASK) >> SYSCTL_CPU_GPR_GPR_SHIFT)

/* Bitfield definition for register of struct array CPU: STATUS0 */
/*
 * STATUS (RO)
 *
 * IRQ values
 */
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_STATUS_STATUS_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_STATUS_STATUS_MASK) >> SYSCTL_CPU_WAKEUP_STATUS_STATUS_SHIFT)

/* Bitfield definition for register of struct array CPU: ENABLE0 */
/*
 * ENABLE (RW)
 *
 * IRQ wakeup enable
 */
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK (0xFFFFFFFFUL)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT (0U)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SET(x) (((uint32_t)(x) << SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK)
#define SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_GET(x) (((uint32_t)(x) & SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_MASK) >> SYSCTL_CPU_WAKEUP_ENABLE_ENABLE_SHIFT)



/* RESOURCE register group index macro definition */
#define SYSCTL_RESOURCE_CPU0 (0UL)
#define SYSCTL_RESOURCE_CPX0 (1UL)
#define SYSCTL_RESOURCE_POW_CPU0 (21UL)
#define SYSCTL_RESOURCE_RST_SOC (22UL)
#define SYSCTL_RESOURCE_RST_CPU0 (23UL)
#define SYSCTL_RESOURCE_CLK_SRC_XTAL (32UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0 (33UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL0 (34UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL0 (35UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK2_PLL0 (36UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1 (37UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL1 (38UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL1 (39UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK2_PLL1 (40UL)
#define SYSCTL_RESOURCE_CLK_SRC_CLK3_PLL1 (41UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL0_REF (42UL)
#define SYSCTL_RESOURCE_CLK_SRC_PLL1_REF (43UL)
#define SYSCTL_RESOURCE_CLK_TOP_CPU0 (64UL)
#define SYSCTL_RESOURCE_CLK_TOP_MCT0 (65UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN0 (66UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN1 (67UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN2 (68UL)
#define SYSCTL_RESOURCE_CLK_TOP_CAN3 (69UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN0 (70UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN1 (71UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN2 (72UL)
#define SYSCTL_RESOURCE_CLK_TOP_LIN3 (73UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR0 (74UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR1 (75UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR2 (76UL)
#define SYSCTL_RESOURCE_CLK_TOP_TMR3 (77UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C0 (78UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C1 (79UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C2 (80UL)
#define SYSCTL_RESOURCE_CLK_TOP_I2C3 (81UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI0 (82UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI1 (83UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI2 (84UL)
#define SYSCTL_RESOURCE_CLK_TOP_SPI3 (85UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT0 (86UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT1 (87UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT2 (88UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT3 (89UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT4 (90UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT5 (91UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT6 (92UL)
#define SYSCTL_RESOURCE_CLK_TOP_URT7 (93UL)
#define SYSCTL_RESOURCE_CLK_TOP_XPI0 (94UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA0 (95UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA1 (96UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA2 (97UL)
#define SYSCTL_RESOURCE_CLK_TOP_ANA3 (98UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF0 (99UL)
#define SYSCTL_RESOURCE_CLK_TOP_REF1 (100UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC0 (101UL)
#define SYSCTL_RESOURCE_CLK_TOP_ADC1 (102UL)
#define SYSCTL_RESOURCE_CLK_TOP_DAC0 (103UL)
#define SYSCTL_RESOURCE_CLK_TOP_DAC1 (104UL)
#define SYSCTL_RESOURCE_AHB0 (256UL)
#define SYSCTL_RESOURCE_LMM0 (257UL)
#define SYSCTL_RESOURCE_MCT0 (258UL)
#define SYSCTL_RESOURCE_ROM0 (259UL)
#define SYSCTL_RESOURCE_CAN0 (260UL)
#define SYSCTL_RESOURCE_CAN1 (261UL)
#define SYSCTL_RESOURCE_CAN2 (262UL)
#define SYSCTL_RESOURCE_CAN3 (263UL)
#define SYSCTL_RESOURCE_PTPC (264UL)
#define SYSCTL_RESOURCE_LIN0 (265UL)
#define SYSCTL_RESOURCE_LIN1 (266UL)
#define SYSCTL_RESOURCE_LIN2 (267UL)
#define SYSCTL_RESOURCE_LIN3 (268UL)
#define SYSCTL_RESOURCE_TMR0 (269UL)
#define SYSCTL_RESOURCE_TMR1 (270UL)
#define SYSCTL_RESOURCE_TMR2 (271UL)
#define SYSCTL_RESOURCE_TMR3 (272UL)
#define SYSCTL_RESOURCE_I2C0 (273UL)
#define SYSCTL_RESOURCE_I2C1 (274UL)
#define SYSCTL_RESOURCE_I2C2 (275UL)
#define SYSCTL_RESOURCE_I2C3 (276UL)
#define SYSCTL_RESOURCE_SPI0 (277UL)
#define SYSCTL_RESOURCE_SPI1 (278UL)
#define SYSCTL_RESOURCE_SPI2 (279UL)
#define SYSCTL_RESOURCE_SPI3 (280UL)
#define SYSCTL_RESOURCE_URT0 (281UL)
#define SYSCTL_RESOURCE_URT1 (282UL)
#define SYSCTL_RESOURCE_URT2 (283UL)
#define SYSCTL_RESOURCE_URT3 (284UL)
#define SYSCTL_RESOURCE_URT4 (285UL)
#define SYSCTL_RESOURCE_URT5 (286UL)
#define SYSCTL_RESOURCE_URT6 (287UL)
#define SYSCTL_RESOURCE_URT7 (288UL)
#define SYSCTL_RESOURCE_WDG0 (289UL)
#define SYSCTL_RESOURCE_WDG1 (290UL)
#define SYSCTL_RESOURCE_MBX0 (291UL)
#define SYSCTL_RESOURCE_TSNS (292UL)
#define SYSCTL_RESOURCE_CRC0 (293UL)
#define SYSCTL_RESOURCE_ADC0 (294UL)
#define SYSCTL_RESOURCE_ADC1 (295UL)
#define SYSCTL_RESOURCE_DAC0 (296UL)
#define SYSCTL_RESOURCE_DAC1 (297UL)
#define SYSCTL_RESOURCE_ACMP (298UL)
#define SYSCTL_RESOURCE_OPA0 (299UL)
#define SYSCTL_RESOURCE_OPA1 (300UL)
#define SYSCTL_RESOURCE_MOT0 (301UL)
#define SYSCTL_RESOURCE_RNG0 (302UL)
#define SYSCTL_RESOURCE_SDP0 (303UL)
#define SYSCTL_RESOURCE_KMAN (304UL)
#define SYSCTL_RESOURCE_GPIO (305UL)
#define SYSCTL_RESOURCE_HDMA (306UL)
#define SYSCTL_RESOURCE_XPI0 (307UL)
#define SYSCTL_RESOURCE_USB0 (308UL)
#define SYSCTL_RESOURCE_REF0 (309UL)
#define SYSCTL_RESOURCE_REF1 (310UL)

/* GROUP0 register group index macro definition */
#define SYSCTL_GROUP0_LINK0 (0UL)
#define SYSCTL_GROUP0_LINK1 (1UL)

/* AFFILIATE register group index macro definition */
#define SYSCTL_AFFILIATE_CPU0 (0UL)

